[
    {
        "id": "argentBank",
        "lien": "https://github.com/Thierry77170/argentBank.git",
        "title":   "Argent Bank",
        "text": "Dans ce projet, j'ai travaillé sur le développement front-end d’une application bancaire en utilisant React et Redux pour créer une expérience utilisateur dynamique et réactive. Ma mission principale était d'intégrer le front-end avec le back-end via des appels API. J'ai écrit des appels à l'API REST pour connecter les deux parties de l'application, assurant une communication fluide entre le client et le serveur. J'ai utilisé React pour développer l'interface utilisateur de l'application bancaire, en me concentrant sur la création d'un tableau de bord complet et responsive pour les utilisateurs. J'ai utilisé Redux pour gérer les données de l'application. Cela m'a permit de maintenir un état global cohérent à travers l'application. Pour définir les points d'accès de l'API et modéliser les interactions avec les données des transactions, j'ai utilisé Swagger. Cet outil m'a aidé à décrire les différentes routes et actions nécessaires pour l'API. J'ai utiliseré Node.js pour exécuter le code JavaScript côté serveur. Cela m'a donné une expérience pratique de la gestion d'une application full-stack."
    },
    {
        "id": "724Events",
        "lien": "https://github.com/Thierry77170/724Events.git",
        "title":  "724 Events",
        "text": ""
    },
    {
        "id": "booki",
        "lien": "https://github.com/Thierry77170/Booki.git",
        "title":  "Booki",
        "text": ""
    },
    {
        "id": "kasa",
        "lien": "https://github.com/Thierry77170/Kasa.git",
        "title":  "Kasa",
        "text": ""
    },
    {
        "id": "ninaCarducci",
        "lien": "https://github.com/Thierry77170/ninaCarducci.git",
        "title":  "Nina CARDUCCI",
        "text": ""
    },
    {
        "id": "ohmyfood",
        "lien": "https://github.com/Thierry77170/Ohmyfood.git",
        "title":  "Ohmyfood",
        "text": ""
    },
    {
        "id": "sophieBluel",
        "lien": "https://github.com/Thierry77170/Portfolio-architecte-sophie-bluel.git",
        "title":  "Sophie BLUEL",
        "text": ""
    }
]
